       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIZZ-BUZZ.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COUNTER PIC 9(3) VALUE 1.
       01 RESULT PIC X(8).
       01 DIVISOR PIC 9(2).
       01 OUT-MESSAGE PIC X(8).
       01 QUOT PIC 9(3).
       01 REM PIC 9.

       PROCEDURE DIVISION.
           PERFORM FIZZBUZZ-LOOP UNTIL COUNTER IS GREATER THAN 100
           GOBACK.

       FIZZBUZZ-LOOP.
           MOVE COUNTER TO RESULT

           MOVE 15 TO DIVISOR
           MOVE "FIZZBUZZ-LOOP" TO OUT-MESSAGE
           PERFORM CHECK-FIZZBUZZ

           MOVE 5 TO DIVISOR
           MOVE "BUZZ" TO OUT-MESSAGE
           PERFORM CHECK-FIZZBUZZ

           MOVE 3 TO DIVISOR
           MOVE "FIZZ" TO OUT-MESSAGE
           PERFORM CHECK-FIZZBUZZ

           DISPLAY RESULT

           ADD 1 TO COUNTER GIVING COUNTER
           .

       CHECK-FIZZBUZZ.
           DIVIDE COUNTER BY DIVISOR GIVING QUOT REMAINDER REM
           IF REM IS EQUAL TO 0
             MOVE OUT-MESSAGE TO RESULT
           END-IF
           .

           END PROGRAM FIZZ-BUZZ.

