       identification division.
       program-id. hello.

       procedure division.
           display "Hello, world"
           display "Apparently this is what modern COBOL looks like"
           goback.

           end program hello.
