       IDENTIFICATION DIVISION.
       PROGRAM-ID. TICTACTOE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 PLAYER-INPUT PIC 9(2).
       01 CURRENT-MOVE PIC A VALUE "X".
       01 GAME-OVER PIC 9 VALUE 0.

       01 BOARD.
         05 CELL PIC A OCCURS 9 TIMES.

       01 WINNING-COMBINATIONS.
         05 IDX PIC 9 OCCURS 3 TIMES.
       
       PROCEDURE DIVISION.
           DISPLAY "COBOL TAC TOE v0.1"
           DISPLAY "================="

           PERFORM GAME-LOOP UNTIL GAME-OVER IS EQUAL TO 1

           GOBACK.

       GAME-LOOP.
           PERFORM SHOW-BOARD 
           PERFORM TAKE-INPUT
           PERFORM CHECK-WIN
           PERFORM CHANGE-PLAYER
           .

       SHOW-BOARD.
           DISPLAY "     "
           DISPLAY CELL(1)"|"CELL(2)"|"CELL(3)
           DISPLAY "-----"
           DISPLAY CELL(4)"|"CELL(5)"|"CELL(6)
           DISPLAY "-----"
           DISPLAY CELL(7)"|"CELL(8)"|"CELL(9)
           DISPLAY "     "
           .

       CHECK-WIN.
           MOVE 123 to WINNING-COMBINATIONS
           PERFORM CHECK-LINE
           MOVE 456 to WINNING-COMBINATIONS
           PERFORM CHECK-LINE
           MOVE 789 to WINNING-COMBINATIONS
           PERFORM CHECK-LINE
           MOVE 147 to WINNING-COMBINATIONS
           PERFORM CHECK-LINE
           MOVE 258 TO WINNING-COMBINATIONS
           PERFORM CHECK-LINE
           MOVE 367 TO WINNING-COMBINATIONS
           PERFORM CHECK-LINE
           MOVE 139 TO WINNING-COMBINATIONS
           PERFORM CHECK-LINE
           MOVE 357 TO WINNING-COMBINATIONS
           PERFORM CHECK-LINE
           .

       TAKE-INPUT.
           ACCEPT PLAYER-INPUT

           IF CELL(PLAYER-INPUT) IS EQUAL TO "X" OR CELL(PLAYER-INPUT) 
             IS EQUAL TO "0" THEN
             DISPLAY "CELL TAKEN. PICK ANOTHER CELL"
             PERFORM TAKE-INPUT
             END-IF

             IF PLAYER-INPUT IS GREATER THAN 9 OR PLAYER-INPUT IS LESS 
               THAN 1 THEN
               DISPLAY "OUT OF RANGE. PICK ANOTHER CELL"
               PERFORM TAKE-INPUT
             END-IF

             SET CELL(PLAYER-INPUT) TO CURRENT-MOVE
             .

       CHANGE-PLAYER.
           IF CURRENT-MOVE IS EQUAL TO "X"
             MOVE "O" TO CURRENT-MOVE
           ELSE
             MOVE "X" TO CURRENT-MOVE
           END-IF
           .

       CHECK-LINE.
           IF CELL(IDX(1)) IS EQUAL TO CURRENT-MOVE 
             AND CELL(IDX(2)) IS EQUAL TO CURRENT-MOVE 
             AND CELL(IDX(3)) IS EQUAL TO CURRENT-MOVE THEN
             MOVE 1 TO GAME-OVER
             PERFORM SHOW-BOARD
             DISPLAY CURRENT-MOVE " IS THE WINNER."
           END-IF
           .

           END PROGRAM TICTACTOE. 
